package zifeng.chapter03;

/**
 *  面向对象
 *     发展历程
 *        面向对象的编程思想是20世纪70年代由IBM得Smalltalk语言推广的，而后又发展到了C++编程语言，最后由C++衍生出了Java;
 *
 *  面向对象与面向过程的比较
 *     面向过程：指的是针对某一个问题单独提出解决方案以及代码开发;
 *     面向对象：以一种组件化的形式进行代码的设计;
 *
 *  面向对象的三大特性：
 *     封装性
 *       封装是面向对象的方法所应遵循的一个重要原则。
 *       保护内部的定义结构安全性;
 *     继承性
 *        面向对象方法中的重要概念，并且是提高软件开发效率的重要手段;
 *        被继承的类称为父类或超类，而经继承产生的类成为子类或派生类; 根据继承的机制，派生类继承了超类的所有成员，并增加了自己的一些新的成员;
 *     多态性
 *        允许程序中出现重名现象;Java语言中含有方法重载与对象多态两种形式的多态。
 *        方法重载：在一个类中，允许多个方法使用同一个名字，但方法的参数不同，完成的功能也不同；
 *        对象多态：子类对象中可以与父类对象进行相互转换，而且根据其使用的子类不同完成的功能也不同；
 *
 *
 *   类与对象
 *      面向对象是整个Java的核心，而类与对象是支撑起Java面向对象开发的基本概念单元
 *
 *
 *    类表示一个客观世界中某类群体的一些基本特征抽象，属于抽象出的概念集合;
 *      类是有属性和方法组成的。属性就是一个变量，方法是一些操作的行为；
 *        扩展:类中的属性在开发中不一定只是变量，也有可能是其他内容，所以一般也会有人将其称为成员（Field）
 *            类中的方法在Java中使用Method单词描述，有的也会将其称为行为;
 *
 *
 *      定义类需要使用class关键字
 *      格式如下:
 *       class 类名称｛
 *            数据类型  属性（变量）;    声明成员变量（属性）
 *
 *       ｝
 *       public 返回值的数据类型 方法名称（参数1，参数2）｛   定义方法的内容
 *             程序语句;
 *             [return 表达式;]
 *       ｝
 *
 *
 *
 *
 *
 *    对象表示一个个具体的事物，如张三的汽车； 而描述这个事物的信息在概念中称为这个事物的属性；   而这些事物的动作行为称为方法；
 *
 *
 *
 *
 *
 *
 *
 *
 *
 */
public class ObjectNote {
}
